from love_bot.core import config
from love_bot.core.keyboards import CANCEL

START_MESSAGE_FOR_ARINA = (
    'Приветище! Каждое утро я буду присылать тебе что-нибудь милое😊 '
    'Если хочешь этого прямо сейчас, жми на левую верхнюю кнопочку. '
    'Я глупенький, поэтому не смогу понимать твои сообщения '
    'и буду пересылать их моему создателю. Там, конечно, тоже не гений сидит, '
    'но у него больше шансов разобраться✨ Также ты можешь делиться с нами '
    'своими снами, мы будем очень рады🤗 В любой момент ты можешь '
    'посмотреть все сны или удалить те, которые захочешь🙌'
)
START_FOR_ME = '🖐️'
MESSAGE_FOR_UNKNOWN_USERS = (
    'Доброго времени суток! Этот бот предназначен '
    'исключительно для одного человека, для Арины Атаманюк. '
    'Если Вы её знаете, передайте ей привет🖐️'
)

SHOW_ARINA_ALL_LOVE_MESSAGE_RESPONSE = 'Вы делаете что-то незаконное🤔'
DELETE_LOVE_MESSAGES_BY_ARINA_RESPONSE = (
    'Вы делаете что-то очень незаконное🤔🤔🤔'
)

LOVE_MESSAGES_DELETING_INVITE = (
    'Список всех сообщений☝️\n'
    'Введите диапазоны сообщений через запятую\n'
    'Пример: 1, 17-19, 23-24'
)

DREAM_WRITING_INVITE = (
    'Напишите, каким сладеньким сном Вы хотите поделиться😋'
)
DREAMS_DELETING_INVITE = (
    'Воть все Ваши сны☝️\n'
    'Фто тут нувно удалить? Мне нувны номера\n'
    'Например: 1, 17-19, 23-24 кнопочка "Отправить"⏎'
)

WRITING_AS_BOT_INVITE = 'Можно вещать'

FILE_IS_EMPTY = 'Пуфто, ничего нет🙃'
NOTHING_TO_DELETE = 'Пуфто, нечева удалять👀'

WRITE_DREAM_REQUEST_IS_EMPTY = (
    'А кде сон, который нувно запифать, я не увидел😫😫😫'
)

OUT_OF_RANGE_INDEXES_ERROR = (
    'Я ничево не удалив, потому што Вы ввели немношко weird номера😯😯'
)

DELETE_DREAMS_REQUEST_IS_INVALID = (
    'В данновый момент Вы находитесь в режиме удаления снов🗑️\n'
    'Проверьте правильность ввода и повторите попытку, '
    f'либо нажмите снизу на кнопочку {CANCEL}, '
    'либо нажмите на команду 👉/start👈'
)

DREAMS_FILE_ERROR = (
    'Какие-то промблемки случились, когда я открывал файлик со снами😕\n'
    'Твой чинильщик всё починит, а я напишу, '
    'когда можно будет повторить попытку😘'
)

CONTENT_IS_SAVED = 'Сохранено☺️'
CONTENT_IS_DELETED = 'Я удалив вот это👆🤙💫'
SUCCESSFULL_SENDING = 'Сообщение отправлено☺️'
CANCEL_RESPONSE = 'Есть "Отмена"🫡'
SUCCESS = '✅'

AFTER_DELETING_NOTIFICATION = (
    'Я показал, а потом удалив, штобы никто не подсмотрел🐻'
)


def get_too_long_dream_warning(symbol_exceeding: int) -> str:
    """
    Возвращает предупреждение о превышении количества символов при записи сна.
    """
    return (
        'Как тут много всего🤯🤯🤯\n'
        'Я могу запомнить сон, в котором максимум '
        f'{config.WRITING_CONTENT_SYMBOL_LIMIT} символов🥺\n'
        f'Сократи, пожалуйста, свой сон на {symbol_exceeding} символов🙏'
    )
